In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
data1 = pd.read_csv("titles.csv")

In [5]:
data1

                                      title  year
0                        Tasveer Mere Sanam  1996
1                                  Only You  1994
2                      El pueblo del terror  1970
3                                   Machine  2007
4                                      MARy  2008
...                                     ...   ...
244909  Black Butterfly in a Colorful World  2018
244910        Hua fei hua wu chun man cheng  1980
244911                 Nippon dabi katsukyu  1970
244912        Under Siege 2: Dark Territory  1995
244913            She Must Be Seeing Things  1987

[244914 rows x 2 columns]

In [6]:
data1.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [10]:
data1.shape

(244914, 2)

# Que 1:  How many movies are listed in the titles dataframe?

In [15]:
data1['title'].count()

244914

# Que 2: What are the earliest two films listed in the titles dataframe?

In [16]:
data1.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

# Que 3: How many movies have the title "Hamlet"?

In [60]:
data1[(data1.title == "Hamlet")].title.count()

20


# Que 4: How many movies are titled "North by Northwest"?

In [61]:
data1[(data1.title == "North by Northwest")].title.count()

1

# Que 5: When was the first movie titled "Hamlet" made?

In [55]:
hamlet = data1[(data1.title == "Hamlet")]    #for getting the hamlet as title
hamlet.sort_values('year').head(1)             #Sorting

        title  year
52521  Hamlet  1910

# Que 6: List all of the "Treasure Island" movies from earliest to most recent.

In [54]:
treasure = data1[(data1.title == "Treasure Island")]                   #for getting treasure island 

treasure.sort_values('year')                              # for printing all values sorted by years

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

# Que 7 :How many movies were made in the year 1950?

In [53]:
data1[(data1.year == 1950)].year.count()

1113

# Que 8: 
How many movies were made in the year 1960?

In [52]:
data1[(data1.year == 1960)].year.count()

1549

# Que 9: How many movies were made from 1950 through 1959?

In [50]:
data1[(data1.year >= 1950) & (data1.year <= 1959 )].year.count()

12934

# Que 10: In what years has a movie titled "Batman" been released?

In [66]:
bat = data1[(data1.title == "Batman")]
bat.head()

         title  year
39349   Batman  1943
240896  Batman  1989

In [68]:
cast1 = pd.read_csv("cast.csv")

In [69]:
cast1.head(5)

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [70]:
cast1.columns

Index(['title', 'year', 'name', 'type', 'character', 'n'], dtype='object')

# Que 11: How many roles were there in the movie "Inception"?

In [73]:
cast1[(cast1.title == "Inception")].character.count()

78

# Que 12: How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [79]:
cast1[(cast1.title == "Inception")].isnull().n.sum()

27

# Que 13: But how many roles in the movie "Inception" did receive an "n" value?

In [80]:
cast1[(cast1.title == "Inception")].notnull().n.sum()

51

# Que 14: Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value

In [97]:

nbn = cast1[(cast1.title == "North by Northwest")].sort_values('n')
nbn.dropna()

,title,year,name,type,character,n
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
3518333,North by Northwest,1959,Eva Marie Saint,actress,Eve Kendall,2.0
1457165,North by Northwest,1959,James Mason,actor,Phillip Vandamm,3.0
3157232,North by Northwest,1959,Jessie Royce Landis,actress,Clara Thornhill,4.0
356707,North by Northwest,1959,Leo G. Carroll,actor,The Professor,5.0
3048272,North by Northwest,1959,Josephine Hutchinson,actress,Mrs. Townsend,6.0
1695173,North by Northwest,1959,Philip Ober,actor,Lester Townsend,7.0
1275337,North by Northwest,1959,Martin Landau,actor,Leonard,8.0
2447081,North by Northwest,1959,Adam Williams,actor,Valerian,9.0
1811387,North by Northwest,1959,Edward Platt,actor,Victor Larrabee,10.0
665768,North by Northwest,1959,Robert Ellenstein,actor,Licht,11.0
2295714,North by Northwest,1959,Les Tremayne,actor,Auctioneer,12.0
464736,North by Northwest,1959,Philip Coolidge,actor,Dr. Cross,13.0
1508344,North by Northwest,1959,Patrick McVey,actor,Sergeant Flamm,14.0
206471,North by Northwest,1959,Edward Binns,actor,Captain Junket,15.0
1384780,North by Northwest,1959,Ken Lynch,actor,Charley - Chicago Policeman,16.0

# Que 15: Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [126]:
sle = cast1[(cast1.title == 'Sleuth') & (cast1.year == 1972)].head()

sle_1972 = sle.sort_values('n')
sle_1972

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

# Que 16 : Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth"

In [128]:
sle = cast1[(cast1.title == 'Sleuth') & (cast1.year == 2007)].head()

sle_1972 = sle.sort_values('n').dropna()
sle_1972

          title  year           name   type    character    n
326774   Sleuth  2007  Michael Caine  actor       Andrew  1.0
1293634  Sleuth  2007       Jude Law  actor         Milo  2.0
1805907  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3.0

# Que 17: How many roles were credited in the silent 1921 version of Hamlet?

In [135]:
hamlet = cast1[(cast1.title == "Hamlet")]
hamlet[hamlet.year == 1921].name.count()

9

# Que 18: How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [136]:
hamlet = cast1[(cast1.title == "Hamlet")]
hamlet[hamlet.year == 1996].name.count()

54

# Que 19: How many "Hamlet" roles have been listed in all film credits through history?

In [139]:
hamlet = cast1[(cast1.title == "Hamlet")]
hamlet.title.count()

342

# Que 20: How many people have played an "Ophelia"?

In [144]:
cast1[(cast1.character == "Ophelia")].name.count()

117

# Que 21: How many people have played a role called "The Dude"?

In [145]:
cast1[(cast1.character == "The Dude")].name.count()

19

# Que 22: How many people have played a role called "The Stranger"?

In [146]:
cast1[(cast1.character == "The Stranger")].name.count()

212

# Que 23: how many roles has Sidney Poitier played throughout his career?

In [154]:
cast1[(cast1.name == "Sidney Poitier")].name.count()

43

# Que 24:  How many roles has Judi Dench played?

In [155]:
cast1[(cast1.name == "Judi Dench")].name.count()

55

# Que 25: List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year

In [158]:
cast1[(cast1.name == "Cary Grant") & (cast1.n == 2) & (cast1.year = 1940 )]

                   title  year        name   type   character    n
871423  My Favorite Wife  1940  Cary Grant  actor  Nick Arden  2.0

# Que 26: List the leading roles that Cary Grant played in the 1940s in order by year.

In [194]:

cg = cast1[(cast1.name == "Cary Grant") & (cast1.year < 1950 ) & (cast1.year >= 1940 )]
cg.sort_values('year').character

871450                      C. K. Dexter Haven
871448                             Matt Howard
871407                            Walter Burns
871423                              Nick Arden
871438                        Johnnie Aysgarth
871433                             Roger Adams
871452                            Leopold Dilg
871429                   Patrick 'Pat' O'Toole
871398                           Capt. Cassidy
871422    Joe Adams -posing as Joe Bascopolous
871390                       Mortimer Brewster
871430                             Jerry Flynn
871425                              Ernie Mott
871405                              Cary Grant
871424                             Cole Porter
871427                                  Devlin
871466                              Cary Grant
871444                             Dick Nugent
871445                                  Dudley
871421                           Jim Blandings
871402                       Dr. Madison Brown
871411                   Captain Henri Rochard
Name: character, dtype: object

# Que 27 : How many roles were available for actors in the 1950s?

In [195]:
cast1[(cast1.type == 'actor') & (cast1.year < 1960) & (cast1.year >= 1950)].character.count()

157738

# Que 28: How many roles were available for actresses in the 1950s?

In [197]:
cast1[(cast1.type == 'actress') & (cast1.year < 1960) & (cast1.year >= 1950)].character.count()

57733

# Que 29: How many leading roles (n=1) were available from the beginning of film history through 1980?

In [200]:
cast1[ (cast1.year <= 1980) & (cast1.n == 1)].character.count()

65140

# Que 30: How many non-leading roles were available through from the beginning of film history through 1980?

In [203]:
cast1[ (cast1.year <= 1980) & (cast1.n != 1)].character.count()

1117667

# Que 31: How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [207]:
cast1[ (cast1.year <= 1980) & (cast1.n.isnull())].character.count()

448347